# Ex - GroupBy

In [34]:
import pandas as pd
import numpy as np
df = pd.read_csv("drinks - drinks.csv")

### Step 2. Import the dataset from this drinks.csv).

### Step 3. Assign it to a variable called drinks.

In [57]:

drinks = df
drinks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     170 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

In [59]:
drinks.head(10)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
5,Antigua & Barbuda,102,128,45,4.9,NaN
6,Argentina,193,25,221,8.3,SA
7,Armenia,21,179,11,3.8,EU
8,Australia,261,72,212,10.4,OC
9,Austria,279,75,191,9.7,EU

### Step 4. Which continent drinks more beer on average?

In [20]:
drinks.groupby('continent')['beer_servings'].sum()

continent
AF    3258
AS    1630
EU    8720
OC    1435
SA    2101
Name: beer_servings, dtype: int64

### Step 5. For each continent print the statistics for wine consumption.

In [39]:
drinks.groupby('continent')['wine_servings'].std()

continent
AF    38.846419
AS    21.667034
EU    97.421738
OC    64.555790
SA    88.620189
Name: wine_servings, dtype: float64

In [41]:
drinks.groupby('continent')['wine_servings'].var()

continent
AF    1509.044267
AS     469.460359
EU    9490.994949
OC    4167.450000
SA    7853.537879
Name: wine_servings, dtype: float64

### Step 6. Print the mean alcohol consumption per continent for every column

In [55]:
drinks.groupby('continent')['total_litres_of_pure_alcohol'].mean()

continent
AF    3.007547
AS    2.170455
EU    8.617778
OC    3.381250
SA    6.308333
Name: total_litres_of_pure_alcohol, dtype: float64

### Step 7. Print the median alcohol consumption per continent for every column

In [24]:
drinks.groupby('continent')['total_litres_of_pure_alcohol'].median()

continent
AF     2.30
AS     1.20
EU    10.00
OC     1.75
SA     6.85
Name: total_litres_of_pure_alcohol, dtype: float64

### Step 8. Print the mean, min and max values for spirit consumption.
#### This time output a DataFrame

In [47]:
mean = drinks["spirit_servings"].mean()
max = drinks["spirit_servings"].max()
min = drinks["spirit_servings"].min()

lable = pd.Series(["mean","min","max"])
values = pd.Series([mean,min,max])

data_sprit = pd.DataFrame({"Lable":lable,"Values":values})

In [49]:
data_sprit

  Lable      Values
0  mean   80.994819
1   min    0.000000
2   max  438.000000